{
  "manifest": {
    "publishingInformation": {
      "locales": {
        "pt-BR": {
          "summary": "Teste seus conhecimentos em Certificação CTFL e descubra se você está preparado para o exame oficial.",
          "examplePhrases": [
            "Alexa, abra Quiz Teste de Software",
            "Alexa, inicie Quiz Teste de Software",
            "Alexa, comece Quiz Teste de Software"
          ],
          "keywords": [
            "Quiz",
            "Teste",
            "Software",
            "Conhecimentos",
            "Perguntas",
            "Respostas",
            "Exercícios",
            "Prática",
            "Estudo",
            "Simulado"
          ],
          "name": "Quiz Teste de Software",
          "description": "Esta skill , Certificação CTFL, permite que você teste seus conhecimentos no campo da engenharia de software e determine se está preparado para a Certificação em Teste de Fundamentos Nível ISTQB (CTFL). A skill apresenta uma série de perguntas de múltipla escolha com base no syllabus CTFL, abordando tópicos como fundamentos de teste, gerenciamento de teste, técnicas de projeto de teste, entre outros.\n\nPara começar, você precisará de um dispositivo compatível com a Alexa, como um Amazon Echo, Echo Dot ou um smartphone com o aplicativo Alexa instalado. Não há requisitos de conta específicos, mas você precisará vincular sua conta Amazon ao dispositivo Alexa e estar conectado à internet para acessar a skill .\n\nAo iniciar a skill , você será apresentado a uma pergunta com opções de resposta. Você pode fornecer sua resposta falando a opção correspondente. A skill fornecerá feedback imediato informando se sua resposta está correta ou incorreta. Se estiver correto, você receberá pontos e poderá avançar para a próxima pergunta. Caso contrário, você terá mais duas tentativas para responder corretamente.\n\nA skill acompanhará sua pontuação à medida que você progride e informará seu score atual após cada pergunta respondida. Se você responder corretamente a todas as perguntas ou atingir a pontuação mínima necessária, a skill fornecerá sua pontuação final e uma mensagem indicando se você foi aprovado ou reprovado.\n\nÉ importante destacar que esta skill  é uma ferramenta de estudo complementar e não substitui o estudo adequado do syllabus CTFL e a realização do exame oficial. Os exemplos de perguntas fornecidos são apenas para fins de prática e familiarização com o formato do exame.\n\nDivirta-se testando seus conhecimentos em Certificação CTFL e boa sorte em sua jornada de aprendizado em engenharia de software!",
          "smallIconUri": "file://assets/images/pt-BR_smallIconUri.png",
          "largeIconUri": "file://assets/images/pt-BR_largeIconUri.png"
        }
      },
      "automaticDistribution": {
        "sourceLocaleForLanguages": [
          {
            "sourceLocale": "pt-BR",
            "language": "pt"
          }
        ],
        "isActive": true
      },
      "isAvailableWorldwide": true,
      "testingInstructions": "{\"ask_dist_username\":\"\",\"ask_dist_password\":\"\",\"ask_dist_testing_instructions\":\"1.\\tAbra o aplicativo Alexa no dispositivo móvel ou acesse o site da Alexa.\\n2.\\tNavegue até a seção de habilidades e procure por \\\"Quiz Teste de Software\\\".\\n3.\\tHabilite a habilidade \\\"Quiz Teste de Software\\\".\\n4.\\tAgora você pode iniciar a habilidade dizendo: \\\"Alexa, abrir Quiz Teste de Software\\\" ou \\\"Alexa, iniciar Quiz Teste de Software\\\".\\n5.\\tA Alexa irá cumprimentá-lo e apresentar as instruções básicas do jogo de perguntas e respostas sobre teste de software.\\n6.\\tA Alexa fará uma pergunta e você terá a chance de responder.\\n7.\\tResponda a pergunta usando comandos de voz, por exemplo: \\\"Minha resposta é A\\\" ou \\\"Opção B\\\".\\n8.\\tA Alexa informará se sua resposta está correta ou incorreta.\\n9.\\tContinue respondendo às perguntas até que todas sejam concluídas.\\n10.\\tNo final do jogo, a Alexa fornecerá sua pontuação total e uma mensagem personalizada com base no seu desempenho.\\n11.\\tSe você deseja jogar novamente, basta dizer: \\\"Alexa, jogar Quiz Teste de Software novamente\\\".\\n12.\\tDivirta-se testando seus conhecimentos em teste de software com a habilidade \\\"Quiz Teste de Software\\\"!\"}",
      "category": "KNOWLEDGE_AND_TRIVIA",
      "distributionMode": "PUBLIC",
      "distributionCountries": []
    },
    "apis": {
      "custom": {
        "endpoint": {
          "uri": "arn:aws:lambda:us-east-1:406004401424:function:27a6bc56-b116-4c31-9361-dab7b85f619e:Release_0"
        },
        "interfaces": [],
        "locales": {},
        "regions": {
          "EU": {
            "endpoint": {
              "uri": "arn:aws:lambda:eu-west-1:406004401424:function:27a6bc56-b116-4c31-9361-dab7b85f619e:Release_0"
            }
          },
          "NA": {
            "endpoint": {
              "uri": "arn:aws:lambda:us-east-1:406004401424:function:27a6bc56-b116-4c31-9361-dab7b85f619e:Release_0"
            }
          },
          "FE": {
            "endpoint": {
              "uri": "arn:aws:lambda:us-west-2:406004401424:function:27a6bc56-b116-4c31-9361-dab7b85f619e:Release_0"
            }
          }
        }
      }
    },
    "manifestVersion": "1.0",
    "permissions": [
      {
        "name": "alexa::household:lists:read"
      },
      {
        "name": "alexa::household:lists:write"
      },
      {
        "name": "alexa::alerts:reminders:skill:readwrite"
      },
      {
        "name": "alexa::person_id:read"
      },
      {
        "name": "alexa::alerts:timers:skill:readwrite"
      }
    ],
    "privacyAndCompliance": {
      "allowsPurchases": false,
      "locales": {
        "pt-BR": {
          "privacyPolicyUrl": "https://github.com/Srjordao/-alexa-skill-quiz-teste-de-software/blob/main/politica-de-privacidade_pt-br.md"
        }
      },
      "containsAds": false,
      "isExportCompliant": true,
      "isChildDirected": false,
      "shoppingKit": {
        "isShoppingActionsEnabled": false,
        "isAmazonAssociatesOnAlexaEnabled": false
      },
      "usesPersonalInfo": false
    }
  }
}